simulations/all_linear_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            wall;
        nFaces          80;
        startFace       82560;
    }
    outlet
    {
        type            wall;
        nFaces          80;
        startFace       82640;
    }
    ellipse
    {
        type            wall;
        nFaces          320;
        startFace       82720;
    }
    topAndBottom
    {
        type            wall;
        nFaces          800;
        startFace       83040;
    }
    frontAndBack
    {
        type            empty;
        nFaces          83200;
        startFace       83840;
    }
)

// ************************************************************************* //
